''' 判断水仙花数是经典题目，经常要求手写代码。
水仙花数（Narcissistic number）也叫超完全数字不变数。
是指一个n位数（n>=3），它每个位上的数字的n次幂之和等于它本身。
比如153,370等都是水仙花数。本次我们只讨论三位数有关情况，更多的变化应用稍作修改即可。 '''

#因为直接运行程序可能如其他DOS窗口运行的一样，运行完程序结束窗口就被销毁，太快来不及看到结果，所以导入OS模块（若不需要可删除）
import os

#主体程序
#输入一个三位数n
n = eval(input('请输入一个三位数:'))
#知识点注释：Python中input默认输出值为string类型，这样之后的四则运算会报错，所以用eval（）自动实现类型转换

#得出百位上的数x
x = n/100
x = int(x)
#知识点注释：因为Python中加减乘除运算后输出默认是浮点类型，有小数，所以用int（）取整

#得出十位上的数y
y = n%100/10
y = int(y)
#此处得到十位上的数字有不同方法，例如也可思考用三位数除以10后减去百位上数字的十倍再取整：y = int((n/10) - (x*10))

#得出个位数z
z = n%10

#判断是不是水仙花数,m为各个数立方和
m = x**3 + y**3 + z**3
#Python中次方可用**，如i的j次方为i**j

if m == n:
    print("\n输入的三位数",end="")#知识点注释：Python中print默认换行，加上,end=""即可保持不换行，使输出在同一行
    print(n,end="")
    print("是水仙花数")
else:
    print("\n输入的三位数",end="")
    print(n,end="")
    print("不是水仙花数")
#主体程序

os.system('pause')#暂停程序
